import { Injectable } from '@angular/core';

import { FilmInterface } from '../interfaces/film.interface';


@Injectable({
  providedIn: 'root'
})
export class FilmService {

  constructor() {}

  private films: FilmInterface[];

  public initFilms(): FilmInterface[] {
    return this.films = [
      {
        id: 1,
        name: 'Хлопаки',
        year: '2019',
        imgUrl: 'https://image.tmdb.org/t/p/w220_and_h330_face/zoFeE5EXIF9vTYQdzoERgjeUSl9.jpg',
        description: 'Хлопаки — це непоштивий погляд на ситуацію, коли супергерої, знамениті як зірки, впливові як політики і шановані, як боги, зловживають суперсилами замість того, щоб творити добро. Безсилі проти надмогутніх, «Хлопаки» вирушають на героїчний бій за правду щодо «Сімки» та їх грізних покровителів — Воут (Мандри).'
      },
      {
        id: 2,
        name: 'Сотня',
        year: '2014',
        imgUrl: 'https://image.tmdb.org/t/p/w220_and_h330_face/sUhf4xnyRK5Quzm1vrG5uxnxu60.jpg',
        description: 'Події в серіалі починають розгортатися після дев\'яносто семи років після того, як всю цивілізацію знищила страшна атомна війна. Високо в космосі на орбіті Землі літає великий космічний корабель, де знаходяться ті, хто вижив після страшної катастрофи. Саме з цього останнього притулку людей на Землю відправляють космічний човник, на якому знаходяться сто малолітніх злочинців.'
      },
      {
        id: 3,
        name: 'Виховані вовками',
        year: '2020',
        imgUrl: 'https://image.tmdb.org/t/p/w220_and_h330_face/mTvSVKMn2Npf6zvYNbGMJnYLtvp.jpg',
        description: 'Після того, як Землю спустошила велика релігійна війна, атеїстичний архітектор-андроїд посилає два своїх творіння - Матір та Батько - створити мирну безбожну колонію на планеті Кеплер-22b. Їхнє зрадницьке завдання загрожує приходом Мітраїка, глибоко набожного релігійного ордену людей, що вижили.'
      },
      {
        id: 4,
        name: 'Надприродне',
        year: '2005',
        imgUrl: 'https://image.tmdb.org/t/p/w220_and_h330_face/iLtWzaK2WKxb1YDk3E9VysMRYNA.jpg',
        description: 'Колись в місті Лоуренс, штат Канзас, мирно жила сім\'я Вінчестерів. Але буквально за один день життя цих людей змінилося назавжди: будинок згорів, у вогні загинула Мері Вінчестер — любляча мати і улюблена дружина. Чотирирічний Дін Вінчестер виніс з вогню свого шестимісячного братика і з тих пір став для нього ангелом охоронцем, готовим на все заради безпеки молодшого брата. А Джон Вінчестер з простого робочого чоловіка, перетворився на сміливого мисливця за нечистю, одержимого ідеєю помститися за смерть дружини. З цією думкою він виховував своїх синів, що стали майстерними бійцями, що б\'ються пліч-о-пліч з батьком.  І саме з Лоуренса почалася безконечна подорож сім\'ї Вінчестерів по безкрайніх просторах Америки у пошуках людей, яким необхідна допомога, яким не вірить поліція, коли справа стосується надприроднього.'
      },
      {
        id: 5,
        name: 'Бійтесь ходячих мерців',
        year: '2015',
        imgUrl: 'https://image.tmdb.org/t/p/w220_and_h330_face/z0yP5kRaC7SlXecVhV037L7PU0g.jpg',
        description: 'Дія розгортається в недалекому майбутньому. Територія колись пахучого Лос-Анджелеса стала зоною сущого кошмару. До апокаліпсису призвело поява величезної кількості бродячих небіжчиків. Ці моторошні створіння стали результатом впливу новітнього вірусу, не відомого раніше науці. Засобів боротьби з напастю поки немає. Одні змирилися з гіркою долею і перетворилися в зомбі або загинули в жахливих муках. Інші роблять відчайдушні спроби вижити в цьому пеклі.'},
      {
        id: 6,
        name: 'Південний Парк',
        year: '1997',
        imgUrl: 'https://image.tmdb.org/t/p/w220_and_h330_face/yodYPqA7x6eWsqTh5gyPtzD98AG.jpg',
        description: 'Основу сюжету складають пригоди чотирьох хлопчиків і їхніх друзів, що живуть у маленькому містечку Південний Парк, штат Колорадо. Серіал висміює проблеми американської культури і поточних світових подій, а також критикує безліч глибоких переконань і табу завдяки пародії і чорному гумору. Позиціонується як мультфільм для дорослих.'},
    ];
  }

}
